tap "ddev/ddev"
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "romkatv/powerlevel10k"
tap "sass/sass"
brew "ack"
brew "gdbm"
brew "libyaml"
brew "readline"
brew "sqlite"
brew "ansible"
brew "automake"
brew "openjdk"
brew "bfg"
brew "bison"
brew "chruby"
brew "libffi"
brew "openssl@1.1"
brew "python@3.9"
brew "colima"
brew "colordiff"
brew "coreutils"
brew "dnsmasq"
brew "dos2unix"
brew "findutils"
brew "gh"
brew "ghostscript"
brew "git"
brew "gnu-sed"
brew "gnupg"
brew "gpatch"
brew "grep"
brew "htop"
brew "httpie"
brew "httrack"
brew "imagemagick"
brew "jenv"
brew "jq"
brew "maven"
brew "mkcert"
brew "mysql-client"
brew "ncdu"
brew "node"
brew "nss"
brew "openconnect"
brew "openjdk@11"
brew "openssh"
brew "pandoc"
brew "patchutils"
brew "pdfgrep"
brew "perl"
brew "php"
brew "php@8.2"
brew "powerlevel10k"
brew "pv"
brew "ruby-build"
brew "rbenv"
brew "rlwrap"
brew "rmlint"
brew "rsync"
brew "ruby"
brew "screen"
brew "shellcheck"
brew "ssh-copy-id"
brew "stow"
brew "terminal-notifier"
brew "the_silver_searcher"
brew "tmux"
brew "vim"
brew "webkit2png"
brew "wget"
brew "wp-cli"
brew "yarn"
brew "yq"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "ddev/ddev/ddev"
cask "1password-cli"
cask "adoptopenjdk11"
cask "apache-directory-studio"
cask "appcleaner"
cask "dbeaver-community"
cask "discord"
cask "font-office-code-pro"
cask "google-chrome"
cask "imageoptim"
cask "iterm2"
cask "jetbrains-toolbox"
cask "kaleidoscope"
cask "little-snitch"
cask "logitech-options"
cask "micro-snitch"
cask "microsoft-teams"
cask "obsidian"
cask "openconnect-gui"
cask "oracle-jdk"
cask "rectangle"
cask "sequel-ace"
cask "sequel-pro"
cask "signal"
cask "slack"
cask "snagit"
cask "soulver"
cask "spotify"
cask "sublime-text"
cask "thunderbird"
cask "transmit"
cask "utm"
cask "visual-studio-code"
cask "zoom"
