tap "dart-lang/dart"
tap "drud/ddev"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "mistertea/et"
tap "romkatv/powerlevel10k"
tap "sass/sass"
brew "ack"
brew "gdbm"
brew "libyaml"
brew "openssl@1.1"
brew "readline"
brew "ansible"
brew "autossh"
brew "bfg"
brew "libffi"
brew "chruby"
brew "colordiff"
brew "coreutils"
brew "dnsmasq", restart_service: true
brew "dos2unix"
brew "ghostscript"
brew "git"
brew "git-filter-repo"
brew "gnu-sed"
brew "gnupg"
brew "htop"
brew "httrack"
brew "imagemagick"
brew "jq"
brew "markdown"
brew "maven"
brew "mcrypt"
brew "mkcert"
brew "mysql-client"
brew "mysql@5.7", restart_service: true
brew "ncdu"
brew "node", link: false
brew "nss"
brew "openconnect"
brew "patchutils"
brew "pdfgrep"
brew "php"
brew "php@7.4"
brew "pv"
brew "rbenv"
brew "rlwrap"
brew "rsync"
brew "ruby", link: true
brew "ssh-copy-id", link: true
brew "stow"
brew "subversion"
brew "the_silver_searcher"
brew "tmux"
brew "vim"
brew "webkit2png"
brew "wget"
brew "wp-cli"
brew "z"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "drud/ddev/ddev"
brew "mistertea/et/et"
brew "romkatv/powerlevel10k/powerlevel10k"
brew "sass/sass/sass"
cask "1password-cli"
cask "apache-directory-studio"
cask "chromedriver"
cask "discord"
cask "firefox"
cask "google-chrome"
cask "harvest"
cask "imageoptim"
cask "iterm2"
cask "java11"
cask "jetbrains-toolbox"
cask "keycastr"
cask "licecap"
cask "openconnect-gui"
cask "sequel-pro"
cask "skitch"
cask "slack"
cask "sublime-text"
cask "visual-studio-code"
