tap "dart-lang/dart"
tap "ddev/ddev"
tap "romkatv/powerlevel10k"
tap "sass/sass"
tap "tabbyml/tabby"
# Search tool like grep, but optimized for programmers
brew "ack"
# Asciicast to GIF converter
brew "agg"
# YAML Parser
brew "libyaml"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Record and share terminal sessions
brew "asciinema"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Ruby environment tool
brew "chruby"
# Color-highlighted diff(1) output
brew "colordiff"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-buildx"
# Isolated development environments using Docker
brew "docker-compose"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU database manager
brew "gdbm"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Interactive command-line tool for using emoji in commit messages
brew "gitmoji"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# GNU grep, egrep and fgrep
brew "grep"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Manage your Java environment
brew "jenv"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Linux virtual machines
brew "lima"
# Development kit for the Java programming language
brew "openjdk"
# Java-based project management
brew "maven"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Open source relational database management system
brew "mysql-client"
# NCurses Disk Usage
brew "ncdu"
# Libraries for security-enabled client and server applications
brew "nss"
# Open client for Cisco AnyConnect VPN
brew "openconnect"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Small collection of programs that operate on patch files
brew "patchutils"
# Search PDFs for strings matching a regular expression
brew "pdfgrep"
# General-purpose scripting language
brew "php"
# General-purpose scripting language
brew "php@8.3"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Theme for zsh
brew "powerlevel10k"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Proxy server that works as a poor man's VPN
brew "sshuttle"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Version control system designed to be a better CVS
brew "subversion"
# Code-search similar to ack
brew "the_silver_searcher"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# DDEV
brew "ddev/ddev/ddev"
# Tabby: AI Coding Assistant
brew "tabbyml/tabby/tabby"
# Command-line interface for 1Password
cask "1password-cli"
# Eclipse-based LDAP browser and directory client
cask "apache-directory-studio"
# Application uninstaller
cask "appcleaner"
# 3D model editor for boxy models and pixel art textures
cask "blockbench"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Universal database tool and SQL client
cask "dbeaver-community"
# Voice and text chat software
cask "discord"
# Web browser
cask "google-chrome"
# Tool to optimise images to a smaller size
cask "imageoptim"
# Vector graphics editor
cask "inkscape"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Animated screen capture application
cask "licecap"
# Host-based application firewall
cask "little-snitch"
# Software used to make Minecraft Java Edition mods
cask "mcreator"
# Monitors and reports any microphone and camera activity
cask "micro-snitch"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Web browser
cask "opera"
# JDK from Oracle
cask "oracle-jdk"
# Minecraft launcher
cask "prismlauncher"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# MySQL/MariaDB database management
cask "sequel-ace"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Screen capture software
cask "snagit"
# Notepad with a built-in calculator
cask "soulver"
# Music streaming service
cask "spotify"
# Text editor for code, markup and prose
cask "sublime-text"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin@21"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin@8"
# Customizable email client
cask "thunderbird"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Video communication and virtual meeting platform
cask "zoom"
# OpenJDK distribution from Azul
cask "zulu@17"
# OpenJDK distribution from Azul
cask "zulu@21"
